In [1]:
import pandas as pd

### Function to add 12 records (rows) based on user input

In [2]:
def add_records():
    records = []
    for i in range(12):
        prod_no = input("Enter Product No: ")
        prod_name = input("Enter Product Name: ")
        jan = int(input("Enter January Sell: "))
        feb = int(input("Enter February Sell: "))
        mar = int(input("Enter March Sell: "))
        apr = int(input("Enter April Sell: "))
        may = int(input("Enter May Sell: "))
        jun = int(input("Enter June Sell: "))
        records.append([prod_no, prod_name, jan, feb, mar, apr, may, jun])
    return records

### 1. Add 12 Records

In [3]:
data = add_records()

Enter Product No:  1
Enter Product Name:  apple
Enter January Sell:  100
Enter February Sell:  200
Enter March Sell:  300
Enter April Sell:  400
Enter May Sell:  500
Enter June Sell:  600
Enter Product No:  2
Enter Product Name:  orange
Enter January Sell:  900
Enter February Sell:  800
Enter March Sell:  700
Enter April Sell:  600
Enter May Sell:  500
Enter June Sell:  400
Enter Product No:  3
Enter Product Name:  watermelon
Enter January Sell:  200
Enter February Sell:  400
Enter March Sell:  600
Enter April Sell:  800
Enter May Sell:  100
Enter June Sell:  300
Enter Product No:  4
Enter Product Name:  mango
Enter January Sell:  900
Enter February Sell:  100
Enter March Sell:  200
Enter April Sell:  300
Enter May Sell:  400
Enter June Sell:  500
Enter Product No:  5
Enter Product Name:  kiwi
Enter January Sell:  600
Enter February Sell:  500
Enter March Sell:  400
Enter April Sell:  300
Enter May Sell:  200
Enter June Sell:  100
Enter Product No:  6
Enter Product Name:  pineapple
Enter January Sell:  500
Enter February Sell:  600
Enter March Sell:  400
Enter April Sell:  300
Enter May Sell:  200
Enter June Sell:  800
Enter Product No:  7
Enter Product Name:  strawberry
Enter January Sell:  700
Enter February Sell:  500
Enter March Sell:  300
Enter April Sell:  100
Enter May Sell:  200
Enter June Sell:  500
Enter Product No:  8
Enter Product Name:  banana
Enter January Sell:  700
Enter February Sell:  500
Enter March Sell:  300
Enter April Sell:  500
Enter May Sell:  700
Enter June Sell:  100
Enter Product No:  9
Enter Product Name:  dragonfruit
Enter January Sell:  500
Enter February Sell:  400
Enter March Sell:  300
Enter April Sell:  600
Enter May Sell:  800
Enter June Sell:  700
Enter Product No:  10
Enter Product Name:  chikoo
Enter January Sell:  600
Enter February Sell:  500
Enter March Sell:  300
Enter April Sell:  200
Enter May Sell:  100
Enter June Sell:  800
Enter Product No:  11
Enter Product Name:  papaya
Enter January Sell:  500
Enter February Sell:  400
Enter March Sell:  600
Enter April Sell:  300
Enter May Sell:  200
Enter June Sell:  600
Enter Product No:  12
Enter Product Name:  peach
Enter January Sell:  400
Enter February Sell:  900
Enter March Sell:  800
Enter April Sell:  600
Enter May Sell:  100
Enter June Sell:  200

### 2. Create DataFrame

In [4]:
columns = ["Prod_No", "Prod_Name", "January", "February", "March", "April", "May", "June"]
df = pd.DataFrame(data, columns=columns)

### Change Column Names

In [5]:
df = df.rename(columns={"Prod_No": "Product No", "Prod_Name": "Product Name"})

### 4. Add "Total Sell" and "Average Sell" columns

In [6]:
df["Total Sell"] = df.iloc[:, 2:].sum(axis=1)
df["Average Sell"] = df.iloc[:, 2:8].mean(axis=1)

### 5. Add 2 rows at the end

In [13]:
df=pd.concat([df,pd.DataFrame([["13","pear",500,200,600,900,700,100],
                              ["14","cherry",900,800,700,600,500,400]],columns=columns)],ignore_index=True)

### 6. Add 2 rows after the 3rd row

In [14]:
insert_row1 = {"Product No": "P8", "Product Name": "Product 8", "January": 8000, "February": 9000, "March": 10000, "April": 11000, "May": 12000, "June": 13000}
insert_row2 = {"Product No": "P9", "Product Name": "Product 9", "January": 9000, "February": 10000, "March": 11000, "April": 12000, "May": 13000, "June": 14000}
df = pd.concat([df.iloc[:3], pd.DataFrame([insert_row1, insert_row2]), df.iloc[3:]]).reset_index(drop=True)

### 7. Print first 5 rows

In [15]:
print("First 5 rows:")
print(df.head(5))

First 5 rows:
  Product No Product Name  January  February  March  April    May   June  \
0          1        apple      100       200    300    400    500    600
1          2       orange      900       800    700    600    500    400
2          3   watermelon      200       400    600    800    100    300
3         P8    Product 8     8000      9000  10000  11000  12000  13000
4         P9    Product 9     9000     10000  11000  12000  13000  14000

   Total Sell  Average Sell Prod_No Prod_Name
0      2100.0         350.0     NaN       NaN
1      3900.0         650.0     NaN       NaN
2      2400.0         400.0     NaN       NaN
3         NaN           NaN     NaN       NaN
4         NaN           NaN     NaN       NaN

### 8. Print last 5 rows

In [16]:
print("\nLast 5 rows:")
print(df.tail(5))

Last 5 rows:
   Product No Product Name  January  February  March  April  May  June  \
11         10       chikoo      600       500    300    200  100   800
12         11       papaya      500       400    600    300  200   600
13         12        peach      400       900    800    600  100   200
14        NaN          NaN      500       200    600    900  700   100
15        NaN          NaN      900       800    700    600  500   400

    Total Sell  Average Sell Prod_No Prod_Name
11      2500.0    416.666667     NaN       NaN
12      2600.0    433.333333     NaN       NaN
13      3000.0    500.000000     NaN       NaN
14         NaN           NaN      13      pear
15         NaN           NaN      14    cherry

### 9. Print rows 6 to 10

In [17]:
print("\nRows 6 to 10:")
print(df.iloc[5:10])

Rows 6 to 10:
  Product No Product Name  January  February  March  April  May  June  \
5          4        mango      900       100    200    300  400   500
6          5         kiwi      600       500    400    300  200   100
7          6    pineapple      500       600    400    300  200   800
8          7   strawberry      700       500    300    100  200   500
9          8       banana      700       500    300    500  700   100

   Total Sell  Average Sell Prod_No Prod_Name
5      2400.0    400.000000     NaN       NaN
6      2100.0    350.000000     NaN       NaN
7      2800.0    466.666667     NaN       NaN
8      2300.0    383.333333     NaN       NaN
9      2800.0    466.666667     NaN       NaN

### 10. Print only product names

In [18]:
print("\nProduct Names:")
print(df["Product Name"])

Product Names:
0           apple
1          orange
2      watermelon
3       Product 8
4       Product 9
5           mango
6            kiwi
7       pineapple
8      strawberry
9          banana
10    dragonfruit
11         chikoo
12         papaya
13          peach
14            NaN
15            NaN
Name: Product Name, dtype: object

### 11. Print January sell with product ID and product name

In [19]:
print("\nJanuary Sell with Product ID and Product Name:")
print(df[["Product No", "Product Name", "January"]])

January Sell with Product ID and Product Name:
   Product No Product Name  January
0           1        apple      100
1           2       orange      900
2           3   watermelon      200
3          P8    Product 8     8000
4          P9    Product 9     9000
5           4        mango      900
6           5         kiwi      600
7           6    pineapple      500
8           7   strawberry      700
9           8       banana      700
10          9  dragonfruit      500
11         10       chikoo      600
12         11       papaya      500
13         12        peach      400
14        NaN          NaN      500
15        NaN          NaN      900

### 12. Print records where January sell > 5000 and February sell > 8000

In [20]:
print("\nRecords where January sell > 5000 and February sell > 8000:")
print(df[(df["January"] > 5000) & (df["February"] > 8000)])

Records where January sell > 5000 and February sell > 8000:
  Product No Product Name  January  February  March  April    May   June  \
3         P8    Product 8     8000      9000  10000  11000  12000  13000
4         P9    Product 9     9000     10000  11000  12000  13000  14000

   Total Sell  Average Sell Prod_No Prod_Name
3         NaN           NaN     NaN       NaN
4         NaN           NaN     NaN       NaN

### 13. Print records in sorting order of Product name

In [21]:
print("\nRecords sorted by Product Name:")
print(df.sort_values(by="Product Name"))

Records sorted by Product Name:
   Product No Product Name  January  February  March  April    May   June  \
3          P8    Product 8     8000      9000  10000  11000  12000  13000
4          P9    Product 9     9000     10000  11000  12000  13000  14000
0           1        apple      100       200    300    400    500    600
9           8       banana      700       500    300    500    700    100
11         10       chikoo      600       500    300    200    100    800
10          9  dragonfruit      500       400    300    600    800    700
6           5         kiwi      600       500    400    300    200    100
5           4        mango      900       100    200    300    400    500
1           2       orange      900       800    700    600    500    400
12         11       papaya      500       400    600    300    200    600
13         12        peach      400       900    800    600    100    200
7           6    pineapple      500       600    400    300    200    800
8           7   strawberry      700       500    300    100    200    500
2           3   watermelon      200       400    600    800    100    300
14        NaN          NaN      500       200    600    900    700    100
15        NaN          NaN      900       800    700    600    500    400

    Total Sell  Average Sell Prod_No Prod_Name
3          NaN           NaN     NaN       NaN
4          NaN           NaN     NaN       NaN
0       2100.0    350.000000     NaN       NaN
9       2800.0    466.666667     NaN       NaN
11      2500.0    416.666667     NaN       NaN
10      3300.0    550.000000     NaN       NaN
6       2100.0    350.000000     NaN       NaN
5       2400.0    400.000000     NaN       NaN
1       3900.0    650.000000     NaN       NaN
12      2600.0    433.333333     NaN       NaN
13      3000.0    500.000000     NaN       NaN
7       2800.0    466.666667     NaN       NaN
8       2300.0    383.333333     NaN       NaN
2       2400.0    400.000000     NaN       NaN
14         NaN           NaN      13      pear
15         NaN           NaN      14    cherry

### 14. Display only odd index number column records

In [22]:
print("\nOdd Index Column Records:")
print(df.iloc[:, 1::2])

Odd Index Column Records:
   Product Name  February  April   June  Average Sell Prod_Name
0         apple       200    400    600    350.000000       NaN
1        orange       800    600    400    650.000000       NaN
2    watermelon       400    800    300    400.000000       NaN
3     Product 8      9000  11000  13000           NaN       NaN
4     Product 9     10000  12000  14000           NaN       NaN
5         mango       100    300    500    400.000000       NaN
6          kiwi       500    300    100    350.000000       NaN
7     pineapple       600    300    800    466.666667       NaN
8    strawberry       500    100    500    383.333333       NaN
9        banana       500    500    100    466.666667       NaN
10  dragonfruit       400    600    700    550.000000       NaN
11       chikoo       500    200    800    416.666667       NaN
12       papaya       400    300    600    433.333333       NaN
13        peach       900    600    200    500.000000       NaN
14          NaN       200    900    100           NaN      pear
15          NaN       800    600    400           NaN    cherry

### 15. Display alternate rows

In [23]:
print("\nAlternate Rows:")
print(df.iloc[::2])

Alternate Rows:
   Product No Product Name  January  February  March  April    May   June  \
0           1        apple      100       200    300    400    500    600
2           3   watermelon      200       400    600    800    100    300
4          P9    Product 9     9000     10000  11000  12000  13000  14000
6           5         kiwi      600       500    400    300    200    100
8           7   strawberry      700       500    300    100    200    500
10          9  dragonfruit      500       400    300    600    800    700
12         11       papaya      500       400    600    300    200    600
14        NaN          NaN      500       200    600    900    700    100

    Total Sell  Average Sell Prod_No Prod_Name
0       2100.0    350.000000     NaN       NaN
2       2400.0    400.000000     NaN       NaN
4          NaN           NaN     NaN       NaN
6       2100.0    350.000000     NaN       NaN
8       2300.0    383.333333     NaN       NaN
10      3300.0    550.000000     NaN       NaN
12      2600.0    433.333333     NaN       NaN
14         NaN           NaN      13      pear